Dapingguo001/px4-1.7.3/src/drivers/rstcan/stm32_can_drv.cpp
#include <nuttx/config.h>

#include <stdio.h>
#include <string.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include "up_internal.h"
#include "up_arch.h"

//#include "os_internal.h"

#include "chip.h"
#include "stm32.h"
#include "stm32_can.h"
#include "stm32_can_drv.h"
#include "rstcan_manager.h"

#define _INAK_TIMEOUT 65535
/* Mailboxes ****************************************************************/

#define _ALL_MAILBOXES  (CAN_TSR_TME0 | CAN_TSR_TME1 | CAN_TSR_TME2)

/* Bit timing ***************************************************************/


#ifndef CONFIG_CAN_TSEG1
#define CONFIG_CAN_TSEG1 6
#endif

#ifndef CONFIG_CAN_TSEG2
#define CONFIG_CAN_TSEG2 7
#endif

#define _BIT_QUANTA (CONFIG_CAN_TSEG1 + CONFIG_CAN_TSEG2 + 1)

#define _MSGLEN(nbytes)        (sizeof(struct rstcan_frame) - RSTCAN_FRAME_MAX_DATA + (nbytes))

static struct can_describe g_can1desc =
{
  .port             = 1,
  .rx0_irq          = STM32_IRQ_CAN1RX0,
  .tx_irq           = STM32_IRQ_CAN1TX,
  .base_addr        = STM32_CAN1_BASE,
  .filter           = 0,
  .baudrate         = CONFIG_CAN1_BAUD,
  .tx_sem           = {0},
  .tx_waiter        = 0,
  .tx_buf_size      = CAN_DRV_PORT_BUF_SIZE,
  .tx_buf_head      = 0,
  .tx_buf_tail      = 0,
};

#if (RSTCAN_PORT_NUM == 2)
static struct can_describe g_can2desc =
{
  .port             = 2,
  .rx0_irq          = STM32_IRQ_CAN2RX0,
  .tx_irq           = STM32_IRQ_CAN2TX,
  .base_addr        = STM32_CAN2_BASE,
  .filter           = 14,//can2的filter编号从14开始
  .baudrate         = CONFIG_CAN2_BAUD,
  .tx_sem           = {0},
  .tx_waiter        = 0,
  .tx_buf_size      = CAN_DRV_PORT_BUF_SIZE,
  .tx_buf_head      = 0,
  .tx_buf_tail      = 0,
};
#endif

#if (RSTCAN_PORT_NUM == 2)
struct can_describe *p_can_desc[RSTCAN_PORT_NUM]={&g_can1desc, &g_can2desc};
#else
struct can_describe *p_can_desc[RSTCAN_PORT_NUM]={&g_can1desc};
#endif

/****************************************************************************
 * Name: _bittiming
 *
 * Description:
 *   Set the CAN bit timing register (BTR) based on the configured BAUD.
 *
 * "The bit timing logic monitors the serial bus-line and performs sampling
 *  and adjustment of the sample point by synchronizing on the start-bit edge
 *  and resynchronizing on the following edges.
 *
 * "Its operation may be explained simply by splitting nominal bit time into
 *  three segments as follows:
 *
 * 1. "Synchronization segment (SYNC_SEG): a bit change is expected to occur
 *     within this time segment. It has a fixed length of one time quantum
 *     (1 x tCAN).
 * 2. "Bit segment 1 (BS1): defines the location of the sample point. It
 *     includes the PROP_SEG and PHASE_SEG1 of the CAN standard. Its duration
 *     is programmable between 1 and 16 time quanta but may be automatically
 *     lengthened to compensate for positive phase drifts due to differences
 *     in the frequency of the various nodes of the network.
 * 3. "Bit segment 2 (BS2): defines the location of the transmit point. It
 *     represents the PHASE_SEG2 of the CAN standard. Its duration is
 *     programmable between 1 and 8 time quanta but may also be automatically
 *     shortened to compensate for negative phase drifts."
 *
 * Pictorially:
 *
 *  |<----------------- NOMINAL BIT TIME ----------------->|
 *  |<- SYNC_SEG ->|<------ BS1 ------>|<------ BS2 ------>|
 *  |<---- Tq ---->|<----- Tbs1 ------>|<----- Tbs2 ------>|
 *
 * Where
 *   Tbs1 is the duration of the BS1 segment
 *   Tbs2 is the duration of the BS2 segment
 *   Tq is the "Time Quantum"
 *
 * Relationships:
 *
 *   baud = 1 / bit_time
 *   bit_time = Tq + Tbs1 + Tbs2
 *   Tbs1 = Tq * ts1
 *   Tbs2 = Tq * ts2
 *   Tq = brp * Tpclk1
 *
 * Where:
 *   Tpclk1 is the period of the APB1 clock (PCLK1).
 *
 * Input Parameter:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/
static int _bittiming(struct can_describe *priv)
{
  uint32_t tmp;
  uint32_t brp;
  uint32_t ts1;
  uint32_t ts2;

//  printf("CAN%d PCLK1: %d baud: %d\n",
  //          priv->port, STM32_PCLK1_FREQUENCY, priv->baudrate);

  /* Try to get _BIT_QUANTA quanta in one bit_time.
   *
   *   bit_time = Tq*(ts1 + ts2 + 1)
   *   nquanta  = bit_time / Tq
   *   nquanta  = (ts1 + ts2 + 1)
   *
   *   bit_time = brp * Tpclk1 * (ts1 + ts2 + 1)
   *   nquanta  = bit_time / brp / Tpclk1
   *            = PCLK1 / baud / brp
   *   brp      = PCLK1 / baud / nquanta;
   *
   * Example:
   *   PCLK1 = 42,000,000 baud = 1,000,000 nquanta = 14 : brp = 3
   *   PCLK1 = 42,000,000 baud =   700,000 nquanta = 14 : brp = 4
   */

  tmp = STM32_PCLK1_FREQUENCY / priv->baudrate;
  if (tmp < _BIT_QUANTA)
    {
      /* At the smallest brp value (1), there are already too few bit times
       * (PCLCK1 / baud) to meet our goal.  brp must be one and we need
       * make some reasonable guesses about ts1 and ts2.
       */

      brp = 1;

      /* In this case, we have to guess a good value for ts1 and ts2 */

      ts1 = (tmp - 1) >> 1;
      ts2 = tmp - ts1 - 1;
      if (ts1 == ts2 && ts1 > 1 && ts2 < CAN_BTR_TSEG2_MAX)
        {
          ts1--;
          ts2++;          
        }
    }

  /* Otherwise, nquanta is _BIT_QUANTA, ts1 is CONFIG_CAN_TSEG1, ts2 is
   * CONFIG_CAN_TSEG2 and we calculate brp to achieve _BIT_QUANTA quanta
   * in the bit time
   */

  else
    {
      ts1 = CONFIG_CAN_TSEG1;
      ts2 = CONFIG_CAN_TSEG2;
      brp = (tmp + (_BIT_QUANTA/2)) / _BIT_QUANTA;
      DEBUGASSERT(brp >=1 && brp <= CAN_BTR_BRP_MAX);
    }

//  printf("TS1: %d TS2: %d BRP: %d\n", ts1, ts2, brp);

 /* Configure bit timing.  This also does the the following, less obvious
   * things.  Unless loopback mode is enabled, it:
   *
   * - Disables silent mode.
   * - Disables loopback mode.
   *
   * NOTE that for the time being, SJW is set to 1 just because I don't
   * know any better.
   */

  tmp = ((brp - 1) << CAN_BTR_BRP_SHIFT) | ((ts1 - 1) << CAN_BTR_TS1_SHIFT) |
        ((ts2 - 1) << CAN_BTR_TS2_SHIFT) | ((1 - 1) << CAN_BTR_SJW_SHIFT);
#ifdef CONFIG_CAN_LOOPBACK
//tmp |= (CAN_BTR_LBKM | CAN_BTR_SILM);
  tmp |= CAN_BTR_LBKM;
#endif

  _writereg(priv, STM32_CAN_BTR_OFFSET, tmp);
  return OK;
}
/****************************************************************************
 * Name: _cellinit
 *
 * Description:
 *   CAN cell initialization
 *
 * Input Parameter:
 *   priv - A pointer to the private data structure for this CAN block
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/
static int _cellinit(struct can_describe *priv)
{
    volatile uint32_t timeout;
    uint32_t regval;
    int ret;

