Dapingguo001/px4-1.7.3/src/drivers/rstcan/stm32_can_drv.cpp
//    printf("CAN%d\n", priv->port);

    /* Exit from sleep mode */

    regval  = _readreg(priv, STM32_CAN_MCR_OFFSET);
    regval &= ~CAN_MCR_SLEEP;
    _writereg(priv, STM32_CAN_MCR_OFFSET, regval);

    /* Configure CAN behavior.  Priority driven request order, not message ID. */

    regval |= CAN_MCR_TXFP;
    _writereg(priv, STM32_CAN_MCR_OFFSET, regval);

    /* Enter initialization mode */

    regval |= CAN_MCR_INRQ;
    _writereg(priv, STM32_CAN_MCR_OFFSET, regval);
    //printf("base_addr=%x write=%x inrq=%x\n", priv->base_addr, regval, MEM_REG(priv->base_addr+STM32_CAN_MCR_OFFSET)/*_readreg(priv, STM32_CAN_MCR_OFFSET)*/);

    /* Wait until initialization mode is acknowledged */

    for (timeout = _INAK_TIMEOUT; timeout > 0; timeout--)
    {
      regval = _readreg(priv, STM32_CAN_MSR_OFFSET);
      if ((regval & CAN_MSR_INAK) != 0)
        {
          /* We are in initialization mode */

          break;
        }
    }

    /* Check for a timeout */

    if (timeout < 1)
    {
      printf("ERROR: Timed out waiting to enter initialization mode\n");
      return -ETIMEDOUT;
    }

    /* Disable the following modes:
    *
    *  - Time triggered communication mode
    *  - Automatic bus-off management
    *  - Automatic wake-up mode
    *  - No automatic retransmission
    *  - Receive FIFO locked mode
    *  - Transmit FIFO priority
    */

    regval   = _readreg(priv, STM32_CAN_MCR_OFFSET);
    regval &= ~(CAN_MCR_TXFP | CAN_MCR_RFLM | CAN_MCR_NART | CAN_MCR_AWUM | CAN_MCR_ABOM | CAN_MCR_TTCM);
    _writereg(priv, STM32_CAN_MCR_OFFSET, regval);

    /* Configure bit timing. */

    ret = _bittiming(priv);
    if (ret < 0)
    {
      printf("ERROR: Failed to set bit timing: %d\n", ret);
      return ret;
    }

    /* Exit initialization mode */

    regval  = _readreg(priv, STM32_CAN_MCR_OFFSET);
    regval &= ~CAN_MCR_INRQ;
    _writereg(priv, STM32_CAN_MCR_OFFSET, regval);

    /* Wait until the initialization mode exit is acknowledged */

    for (timeout = _INAK_TIMEOUT; timeout > 0; timeout--)
    {
      regval = _readreg(priv, STM32_CAN_MSR_OFFSET);
      if ((regval & CAN_MSR_INAK) == 0)
        {
          /* We are out of initialization mode */

          break;
        }
    }

    /* Check for a timeout */

    if (timeout < 1)
    {
      printf("ERROR: Timed out waiting to exit initialization mode: %08x\n", regval);
      return -ETIMEDOUT;
    }
    return OK;


}

/****************************************************************************
 * Name: _filterinit
 *
 * Description:
 *   CAN filter initialization.  CAN filters are not currently used by this
 *   driver.  The CAN filters can be configured in a different way:
 *
 *   1. As a match of specific IDs in a list (IdList mode), or as
 *   2. And ID and a mask (IdMask mode).
 *
 *   Filters can also be configured as:
 *
 *   3. 16- or 32-bit.  The advantage of 16-bit filters is that you get
 *      more filters;  The advantage of 32-bit filters is that you get 
 *      finer control of the filtering.
 *
 *   One filter is set up for each CAN.  The filter resources are shared
 *   between the two CAN modules:  CAN1 uses only filter 0 (but reserves
 *   0 through CAN_NFILTERS/2-1); CAN2 uses only filter CAN_NFILTERS/2
 *   (but reserves CAN_NFILTERS/2 through CAN_NFILTERS-1).
 *
 *   32-bit IdMask mode is configured.  However, both the ID and the MASK
 *   are set to zero thus supressing all filtering because anything masked
 *   with zero matches zero.
 *
 * Input Parameter:
 *   priv - A pointer to the private data structure for this CAN block
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int _filterinit(struct can_describe *priv)
{
  uint32_t regval;
  uint32_t bitmask;
  //由于滤波器是两个can公用，所以只有一个地址
  struct can_describe *priv_can1 = p_can_desc[0];

  if(priv_can1 == NULL)
      return -1;
//  printf("CAN%d filter: %d\n", priv->port, priv->filter);

  /* Get the bitmask associated with the filter used by this CAN block */

  bitmask = ((uint32_t)1) << priv->filter;

  /* Enter filter initialization mode */

  regval  = _readreg(priv_can1, STM32_CAN_FMR_OFFSET);
  regval |= CAN_FMR_FINIT;
  _writereg(priv_can1, STM32_CAN_FMR_OFFSET, regval);

  /* Disable the filter */

  regval  = _readreg(priv_can1, STM32_CAN_FA1R_OFFSET);
  regval &= ~bitmask;
  _writereg(priv_can1, STM32_CAN_FA1R_OFFSET, regval);

  /* Select the 32-bit scale for the filter */

  regval  = _readreg(priv_can1, STM32_CAN_FS1R_OFFSET);
  regval |= bitmask;
  _writereg(priv_can1, STM32_CAN_FS1R_OFFSET, regval);
 
  /* There are 14 or 28 filter banks (depending) on the device.  Each filter bank is
   * composed of two 32-bit registers, CAN_FiR:
   */

  _writereg(priv_can1,  STM32_CAN_FIR_OFFSET(priv->filter, 1), 0);
  _writereg(priv_can1,  STM32_CAN_FIR_OFFSET(priv->filter, 2), 0);

 /* Set Id/Mask mode for the filter */

  regval  = _readreg(priv_can1, STM32_CAN_FM1R_OFFSET);
  regval &= ~bitmask;
  _writereg(priv_can1, STM32_CAN_FM1R_OFFSET, regval);

 /* Assign FIFO 0 for the filter */

  regval  = _readreg(priv_can1, STM32_CAN_FFA1R_OFFSET);
  regval &= ~bitmask;
  _writereg(priv_can1, STM32_CAN_FFA1R_OFFSET, regval);
 
  /* Enable the filter */

  regval  = _readreg(priv_can1, STM32_CAN_FA1R_OFFSET);
  regval |= bitmask;
  _writereg(priv_can1, STM32_CAN_FA1R_OFFSET, regval);

  /* Exit filter initialization mode */

  regval  = _readreg(priv_can1, STM32_CAN_FMR_OFFSET);
  regval &= ~CAN_FMR_FINIT;
  _writereg(priv_can1, STM32_CAN_FMR_OFFSET, regval);
  return OK;
}

static int32_t _recv_frame(struct can_describe *desc, struct rstcan_frame *frame)
{
    RSTCan_Manager::get_instance(desc->port-1)->can_rx(frame);

    return 0;
}

/****************************************************************************
 * Name: can_drv_rx0_isr
 *
 * Description:
 *   CAN RX FIFO 0 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_drv_rx0_isr(int irq, void *context, void *arg)
{
    FAR struct can_describe *priv = NULL;
    struct rstcan_frame frame;
    uint32_t regval;
    int npending;

