Dapingguo001/px4-1.7.3/src/drivers/rstcan/stm32_can_drv.cpp
    if (g_can1desc.rx0_irq == irq)
    {
        priv = &g_can1desc;
    }
#if (RSTCAN_PORT_NUM == 2)
    else if (g_can2desc.rx0_irq == irq)
    {
        priv = &g_can2desc;
    }
#endif

    /* Verify that a message is pending in FIFO 0 */

    regval   = _readreg(priv, STM32_CAN_RF0R_OFFSET);
    npending = (regval & CAN_RFR_FMP_MASK) >> CAN_RFR_FMP_SHIFT;
    if (npending < 1)
    {
      //printf("WARNING: No messages pending\n");
      return OK;
    }

    /* Get the CAN identifier. */

    regval = _readreg(priv, STM32_CAN_RI0R_OFFSET);

    if ((regval & CAN_RIR_IDE) != 0)
    {
        frame.can_id  = (regval & CAN_RIR_EXID_MASK) >> CAN_RIR_EXID_SHIFT;
        frame.ide     = true;
    }
    else
    {
        frame.can_id    = (regval & CAN_RIR_STID_MASK) >> CAN_RIR_STID_SHIFT;
        frame.ide       = false;
    }

    /* Extract the RTR bit */

    frame.rtr   = (regval & CAN_RIR_RTR) != 0 ? true : false;

    /* Get the DLC */

    regval       = _readreg(priv, STM32_CAN_RDT0R_OFFSET);
    frame.dlc   = (regval & CAN_RDTR_DLC_MASK) >> CAN_RDTR_DLC_SHIFT;

    /* Save the message data */

    regval  = _readreg(priv, STM32_CAN_RDL0R_OFFSET);
    frame.data[0] = (regval & CAN_RDLR_DATA0_MASK) >> CAN_RDLR_DATA0_SHIFT;
    frame.data[1] = (regval & CAN_RDLR_DATA1_MASK) >> CAN_RDLR_DATA1_SHIFT;
    frame.data[2] = (regval & CAN_RDLR_DATA2_MASK) >> CAN_RDLR_DATA2_SHIFT;
    frame.data[3] = (regval & CAN_RDLR_DATA3_MASK) >> CAN_RDLR_DATA3_SHIFT;

    regval  = _readreg(priv, STM32_CAN_RDH0R_OFFSET);
    frame.data[4] = (regval & CAN_RDHR_DATA4_MASK) >> CAN_RDHR_DATA4_SHIFT;
    frame.data[5] = (regval & CAN_RDHR_DATA5_MASK) >> CAN_RDHR_DATA5_SHIFT;
    frame.data[6] = (regval & CAN_RDHR_DATA6_MASK) >> CAN_RDHR_DATA6_SHIFT;
    frame.data[7] = (regval & CAN_RDHR_DATA7_MASK) >> CAN_RDHR_DATA7_SHIFT;

    /* Provide the data to the app*/

    _recv_frame(priv, &frame);

    /* Release the FIFO0 */
    regval  = _readreg(priv, STM32_CAN_RF0R_OFFSET);
    regval |= CAN_RFR_RFOM;
    _writereg(priv, STM32_CAN_RF0R_OFFSET, regval);
    return OK;
}

static bool _txfifo_empty(FAR struct can_describe *priv)
{
  uint32_t regval;

  /* Return true if all mailboxes are available */

  regval = _readreg(priv, STM32_CAN_TSR_OFFSET);
  //printf("CAN%d TSR: %08x\n", priv->port, regval);

  if ((regval & _ALL_MAILBOXES ) == _ALL_MAILBOXES )
    {
      return true;
    }
  return false;
}

static bool _txfifo_ready(FAR struct can_describe *priv)
{
  uint32_t regval;

  /* Return true if any mailbox is available */

  regval = _readreg(priv, STM32_CAN_TSR_OFFSET);
//  printf("CAN%d TSR: %08x\n", priv->port, regval);

  //if ((regval & _ALL_MAILBOXES ) != 0)
  //can控制器bug, 必须等3个邮箱都空再发,不然数据量大的时候会丢数据
  if ((regval & _ALL_MAILBOXES ) == _ALL_MAILBOXES )
    {
      return true;
    }
  return false;
}

/****************************************************************************
 * Name: _send_fifo
 *
 * Description:
 *    Send one can message.
 *
 *    One CAN-message consists of a maximum of 10 bytes.  A message is
 *    composed of at least the first 2 bytes (when there are no data bytes).
 *
 *    Byte 0:      Bits 0-7: Bits 3-10 of the 11-bit CAN identifier
 *    Byte 1:      Bits 5-7: Bits 0-2 of the 11-bit CAN identifier
 *                 Bit 4:    Remote Tranmission Request (RTR)
 *                 Bits 0-3: Data Length Code (DLC)
 *    Bytes 2-10: CAN data
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int _send_fifo(FAR struct can_describe *priv, FAR struct rstcan_frame *msg)
{
    FAR uint8_t *ptr;
    uint32_t regval;
    uint32_t tmp;
    int dlc;
    int txmb;

    //printf("send CAN%d ID: %d DLC: %d\n", priv->port, msg->can_id, msg->dlc);

    /* Select one empty transmit mailbox */

    regval = _readreg(priv, STM32_CAN_TSR_OFFSET);
    if ((regval & CAN_TSR_TME0) != 0)
    {
      txmb = 0;
    }
    else if ((regval & CAN_TSR_TME1) != 0)
    {
      txmb = 1;
    }
    else if ((regval & CAN_TSR_TME2) != 0)
    {
      txmb = 2;
    }
    else
    {
      printf("ERROR: No available mailbox\n");
      return -EBUSY;
    }

    /* Clear TXRQ, RTR, IDE, EXID, and STID fields */

    regval  = _readreg(priv, STM32_CAN_TIR_OFFSET(txmb));
    regval &= ~(CAN_TIR_TXRQ | CAN_TIR_RTR | CAN_TIR_IDE | CAN_TIR_EXID_MASK | CAN_TIR_STID_MASK);
    _writereg(priv, STM32_CAN_TIR_OFFSET(txmb), regval);

    /* Set up the ID, standard 11-bit or extended 29-bit. */
    regval &= ~CAN_TIR_EXID_MASK;
    if (msg->ide)
    {
      DEBUGASSERT(msg->can_id < (1 << 29));
      regval |= (msg->can_id << CAN_TIR_EXID_SHIFT) | CAN_TIR_IDE;
    }
    else
    {
      DEBUGASSERT(msg->can_id < (1 << 11));
      regval |= msg->can_id << CAN_TIR_STID_SHIFT;
    }

    //robsense modify 判断是否要发远程帧
    if(msg->rtr)
      regval |= CAN_TIR_RTR;

    _writereg(priv, STM32_CAN_TIR_OFFSET(txmb), regval);

    /* Set up the DLC */

    dlc     = msg->dlc;
    regval  = _readreg(priv, STM32_CAN_TDTR_OFFSET(txmb));
    regval &= ~(CAN_TDTR_DLC_MASK | CAN_TDTR_TGT);
    regval |= (uint32_t)dlc << CAN_TDTR_DLC_SHIFT;
    _writereg(priv, STM32_CAN_TDTR_OFFSET(txmb), regval);

    /* Set up the data fields */

    ptr    = msg->data;
    regval = 0;

    if (dlc > 0)
    {
      tmp    = (uint32_t)*ptr++;
      regval = tmp << CAN_TDLR_DATA0_SHIFT;

      if (dlc > 1)
       {
         tmp    = (uint32_t)*ptr++;
         regval |= tmp << CAN_TDLR_DATA1_SHIFT;

         if (dlc > 2)
           {
             tmp    = (uint32_t)*ptr++;
             regval |= tmp << CAN_TDLR_DATA2_SHIFT;

             if (dlc > 3)
               {
                 tmp    = (uint32_t)*ptr++;
                 regval |= tmp << CAN_TDLR_DATA3_SHIFT;
               }
           }
       }
    }
    _writereg(priv, STM32_CAN_TDLR_OFFSET(txmb), regval);

    regval = 0;
    if (dlc > 4)
    {
      tmp    = (uint32_t)*ptr++;
      regval = tmp << CAN_TDHR_DATA4_SHIFT;

      if (dlc > 5)
       {
         tmp    = (uint32_t)*ptr++;
         regval |= tmp << CAN_TDHR_DATA5_SHIFT;

         if (dlc > 6)
           {
             tmp    = (uint32_t)*ptr++;
             regval |= tmp << CAN_TDHR_DATA6_SHIFT;

