Dapingguo001/px4-1.7.3/src/drivers/rstcan/stm32_can_drv.cpp
             if (dlc > 7)
               {
                 tmp    = (uint32_t)*ptr++;
                 regval |= tmp << CAN_TDHR_DATA7_SHIFT;
               }
           }
       }
    }
    _writereg(priv, STM32_CAN_TDHR_OFFSET(txmb), regval);

    /* Enable the transmit mailbox empty interrupt (may already be enabled) */

    regval  = _readreg(priv, STM32_CAN_IER_OFFSET);
    regval |= CAN_IER_TMEIE;
    _writereg(priv, STM32_CAN_IER_OFFSET, regval);

    /* Request transmission */

    regval  = _readreg(priv, STM32_CAN_TIR_OFFSET(txmb));
    regval |= CAN_TIR_TXRQ;  /* Transmit Mailbox Request */
    _writereg(priv, STM32_CAN_TIR_OFFSET(txmb), regval);

    //  can_dumpmbregs(priv, "After send");
    return OK;
}

static int32_t _send_hardware(struct can_describe *desc)
{
    int32_t ret = 0;
    uint16_t _tail;

    while(BUF_AVAILABLE(desc->tx_buf) != 0 && _txfifo_ready(desc))
    {
       /* Send the next message at the FIFO queue index */

        ret = _send_fifo(desc, &desc->tx_buf[desc->tx_buf_head]);
        if (ret != OK)
        {
            printf("dev_send failed: %d\n", ret);
            break;
        }

        BUF_ADVANCEHEAD(desc->tx_buf, 1);
    }


    return 0;
}

//获取发送缓冲剩余的字节数
int32_t can_drv_get_send_space(void *fd)
{
    struct can_describe *desc = (struct can_describe *)fd;
    uint16_t _head;

    return BUF_SPACE(desc->tx_buf) * RSTCAN_FRAME_MAX_DATA;
    
}

static void _send_timeout(void *arg)
{
    sem_t *p_sem = (sem_t *)arg;
    sem_post(p_sem);
}

int32_t can_drv_send_frame(void *fd, struct rstcan_frame *frame)
{
    uint16_t msglen;
    uint16_t _head, space;
    irqstate_t            flags = 0;
    struct can_describe *desc = (struct can_describe *)fd;
    struct hrt_call timeout_call;

    //关闭中断,确保原子操作,防止其他线程打断
    flags = up_irq_save();

    space = BUF_SPACE(desc->tx_buf);
    if (space == 0) {
      //  printf("warning can tx buf full\n");
        up_irq_restore(flags);
        return -1;
    }

    msglen = _MSGLEN(frame->dlc);
    memcpy(&desc->tx_buf[desc->tx_buf_tail], frame, msglen);
    BUF_ADVANCETAIL(desc->tx_buf, 1);

    if(_txfifo_empty(desc))
    {
        _send_hardware(desc);    
        hrt_call_after(&timeout_call,
			       1000,
			       _send_timeout,
			       (void *)&desc->tx_sem);

        /* Wait for a message to be sent */
        desc->tx_waiter++;
        sem_wait(&desc->tx_sem);
        desc->tx_waiter--;
        hrt_cancel(&timeout_call);
    }

    up_irq_restore(flags);
    return 0;
}

/****************************************************************************
 * Name: can_drv_tx_isr
 *
 * Description:
 *   CAN TX mailbox complete interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_drv_tx_isr(int irq, void *context, void *arg)
{
    FAR struct can_describe *priv = NULL;
    uint32_t regval;

    if (g_can1desc.tx_irq == irq)
    {
        priv = &g_can1desc;
    }
#if (RSTCAN_PORT_NUM == 2)
    else if (g_can2desc.tx_irq == irq)
    {
        priv = &g_can2desc;
    }
#endif


    /* Get the transmit status */

    regval = _readreg(priv, STM32_CAN_TSR_OFFSET);

    /* Check for RQCP0: Request completed mailbox 0 */

    if ((regval & CAN_TSR_RQCP0) != 0)
    {
      /* Writing '1' to RCP0 clears RCP0 and all the status bits (TXOK0,
       * ALST0 and TERR0) for Mailbox 0.
       */

      _writereg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP0);

      /* Check for errors */

      if ((regval & CAN_TSR_TXOK0) != 0)
        {
          /* Tell the upper half that the tansfer is finished. */

            (void)_send_hardware(priv);
            if(priv->tx_waiter > 0)
                sem_post(&priv->tx_sem);
        }
    }

    /* Check for RQCP1: Request completed mailbox 1 */

    if ((regval & CAN_TSR_RQCP1) != 0)
    {
      /* Writing '1' to RCP1 clears RCP1 and all the status bits (TXOK1,
       * ALST1 and TERR1) for Mailbox 1.
       */

      _writereg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP1);

      /* Check for errors */

      if ((regval & CAN_TSR_TXOK1) != 0)
        {
          /* Tell the upper half that the tansfer is finished. */

          (void)_send_hardware(priv);
            if(priv->tx_waiter > 0)
                sem_post(&priv->tx_sem);
        }
    }

    /* Check for RQCP2: Request completed mailbox 2 */

    if ((regval & CAN_TSR_RQCP2) != 0)
    {
      /* Writing '1' to RCP2 clears RCP2 and all the status bits (TXOK2,
       * ALST2 and TERR2) for Mailbox 2.
       */

      _writereg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP2);

      /* Check for errors */

      if ((regval & CAN_TSR_TXOK2) != 0)
        {
          /* Tell the upper half that the tansfer is finished. */

          (void)_send_hardware(priv);
            if(priv->tx_waiter > 0)
                sem_post(&priv->tx_sem);
        }
    }

    return OK;
}


void *can_drv_init(uint8_t port)
{
    uint32_t regval;
    int32_t ret = 0;
    struct can_describe *priv = p_can_desc[port];

    printf("CAN%d RX0 irq: %d TX irq: %d\n", priv->port, priv->rx0_irq, priv->tx_irq);

    //初始化can的发送信号量
    sem_init(&priv->tx_sem, 0, 0);

    if(port == 0)
    {
        /* Configure CAN1 pins.  The ambiguous settings in the stm32*_pinmap.h
        * file must have been disambiguated in the board.h file.
        */

        stm32_configgpio(GPIO_CAN1_RX);
        stm32_configgpio(GPIO_CAN1_TX);

    }
#if (RSTCAN_PORT_NUM == 2)
    else if(port == 1)
    {
        /* Configure CAN2 pins.  The ambiguous settings in the stm32*_pinmap.h
        * file must have been disambiguated in the board.h file.
        */

        stm32_configgpio(GPIO_CAN2_RX);
        stm32_configgpio(GPIO_CAN2_TX);

    }
#endif
    else
    {
        printf("no such can port:%d\n", port);
        return NULL;
    }

