Dapingguo001/px4-1.7.3/src/drivers/rstcan/stm32_can_drv.cpp
    /* CAN cell initialization */
    ret = _cellinit(priv);
    if (ret < 0)
    {
        printf("CAN%d cell initialization failed: %d\n", priv->port, ret);
        return NULL;
    }

    /* CAN filter initialization */
    ret = _filterinit(priv);
    if (ret < 0)
    {
      printf("CAN%d filter initialization failed: %d\n", priv->port, ret);
      return NULL;
    }

    /* Attach the CAN RX FIFO 0 interrupt and TX interrupts.  The others are not used */

    ret = irq_attach(priv->rx0_irq, can_drv_rx0_isr, nullptr);
    if (ret < 0)
    {
        printf("Failed to attach CAN%d RX0 IRQ (%d)", priv->port, priv->rx0_irq);
        return NULL;
    }

    ret = irq_attach(priv->tx_irq, can_drv_tx_isr, nullptr);
    if (ret < 0)
    {
        printf("Failed to attach CAN%d TX IRQ (%d)", priv->port, priv->tx_irq);
        return NULL;
    }

    /* Enable the interrupts at the NVIC.  Interrupts arestill disabled in
    * the CAN module.  Since we coming out of reset here, there should be
    * no pending interrupts.
    */

    up_enable_irq(priv->rx0_irq);
    up_enable_irq(priv->tx_irq);

    /* Enable the transmit mailbox empty interrupt (may already be enabled) */

    regval  = _readreg(priv, STM32_CAN_IER_OFFSET);
    regval |= CAN_IER_TMEIE;
    _writereg(priv, STM32_CAN_IER_OFFSET, regval);

    /* Enable/disable the FIFO 0 message pending interrupt */
    /*有数据在fifo中pending就产生中断*/
    regval = _readreg(priv, STM32_CAN_IER_OFFSET);
    regval |= CAN_IER_FMPIE0;
    _writereg(priv, STM32_CAN_IER_OFFSET, regval);

    return (void *)priv;
}



